{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "E1",
    "1": "E2",
    "2": "E3",
    "3": "E4",
    "4": "E5",
    "5": "E6",
    "6": "G1",
    "7": "G2",
    "8": "G3",
    "9": "G4",
    "10": "OTHER",
    "11": "S1",
    "12": "S2",
    "13": "S3",
    "14": "S4",
    "15": "S5",
    "16": "X1"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "E1": 0,
    "E2": 1,
    "E3": 2,
    "E4": 3,
    "E5": 4,
    "E6": 5,
    "G1": 6,
    "G2": 7,
    "G3": 8,
    "G4": 9,
    "OTHER": 10,
    "S1": 11,
    "S2": 12,
    "S3": 13,
    "S4": 14,
    "S5": 15,
    "X1": 16
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.12.1",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 50500
}
